Repository: duxweb/dmux
Catalog: Sources/DmuxWorkspace/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# performance.monitor.graphics_format
source: GFX %@
de: Grafik %@
es: Gráficos %@
fr: Graphiques %@
ja: グラフィック %@
ko: 그래픽 %@
pt_br: Gráficos %@
ru: Графика %@
zh_hans: 图形 %@
zh_hant: 圖形 %@

# welcome.open_project
source: Open Project
de: Projekt öffnen
es: Abrir proyecto
fr: Ouvrir le projet
ja: プロジェクトを開く
ko: 프로젝트 열기
pt_br: Abrir projeto
ru: Открыть проект
zh_hans: 打开项目
zh_hant: 打開專案

# pet.persona.midnight_thinker
source: Darknet Oracle
de: Darknet-Orakel
es: Oráculo Darknet
fr: Oracle du Darknet
ja: ダークネットの予言者
ko: 다크넷 오라클
pt_br: Oráculo Darknet
ru: Оракул даркнета
zh_hans: 暗网先知
zh_hant: 暗網先知

# pet.persona.philosopher
source: Core Architect
de: Kernarchitekt
es: Arquitecto central
fr: Architecte central
ja: コアアーキテクト
ko: 코어 아키텍트
pt_br: Arquiteto central
ru: Главный архитектор
zh_hans: 核心构架师
zh_hant: 核心構架師

# pet.persona.night_companion
source: Neon Specter
de: Neon-Gespenst
es: Espectro neón
fr: Spectre néon
ja: ネオンスペクター
ko: 네온 스펙터
pt_br: Espectro neon
ru: Неоновый призрак
zh_hans: 霓虹幽魂
zh_hant: 霓虹幽魂

# pet.persona.debug_comrade
source: Neural Patch
de: Neuronaler Patch
es: Parche neural
fr: Patch neural
ja: ニューラルパッチ
ko: 뉴럴 패치
pt_br: Patch neural
ru: Нейропатч
zh_hans: 神经补丁
zh_hant: 神經補丁

# pet.persona.night_owl
source: Shadow Crawler
de: Schattenkriecher
es: Rastreador de sombras
fr: Rampeur des ombres
ja: シャドウクローラー
ko: 섀도우 크롤러
pt_br: Rastejador das sombras
ru: Ночной сталкер
zh_hans: 暗影爬行者
zh_hant: 暗影爬行者

# pet.persona.firebrand
source: Overclock
de: Übertaktung
es: Overclocking
fr: Overclocking
ja: オーバークロック
ko: 오버클럭
ru: Оверклок
zh_hans: 超频失控
zh_hant: 超頻失控

# pet.persona.action_seeker
source: Full Throttle
de: Vollgas
es: A plena potencia
fr: Plein régime
ja: フルスロットル
ko: 풀 스로틀
pt_br: Aceleração total
ru: Полный газ
zh_hans: 全速模式
zh_hant: 全速模式

# pet.persona.marathoner
source: Iron Protocol
de: Eisenprotokoll
es: Protocolo de hierro
fr: Protocole de fer
ja: アイアンプロトコル
ko: 아이언 프로토콜
pt_br: Protocolo de ferro
ru: Железный протокол
zh_hans: 铁甲协议
zh_hant: 鐵甲協議

# pet.persona.steady_type
source: Steady Kernel
de: Stabiler Kernel
es: Núcleo estable
fr: Noyau stable
ja: ステディカーネル
ko: 스테디 커널
pt_br: Núcleo estável
ru: Стабильное ядро
zh_hans: 稳态内核
zh_hant: 穩態內核

# pet.persona.debug_buddy
source: Sync Node
de: Sync-Knoten
es: Nodo sincronizado
fr: Nœud de sync
ja: シンクノード
ko: 싱크 노드
pt_br: Nó sincronizado
ru: Синк-узел
zh_hans: 同频节点
zh_hant: 同頻節點

# pet.persona.wise_type
source: Deep Cache
de: Tiefer Cache
es: Caché profundo
fr: Cache profond
ja: ディープキャッシュ
ko: 딥 캐시
pt_br: Cache profundo
ru: Глубокий кэш
zh_hans: 深层缓存
zh_hant: 深層緩存

# pet.species.rusthound.base
source: Ruff
de: Wuffi
es: Rufi
fr: Roufi
ja: ワンワン
ko: 멍멍
pt_br: Rufinho
ru: Гавчик
zh_hans: 旺旺
zh_hant: 旺旺

# pet.species.goose.base
source: Goosey
de: Gänschen
es: Oquita
fr: Oison
ja: グーグー
ko: 꽥꽥
pt_br: Gansinho
ru: Гусик
zh_hans: 咕咕
zh_hant: 咕咕

# pet.claim.rusthound.title
source: Ruff
de: Wuffi
es: Rufi
fr: Roufi
ja: ワンワン
ko: 멍멍
pt_br: Rufinho
ru: Гавчик
zh_hans: 旺旺
zh_hant: 旺旺

# pet.claim.goose.title
source: Goosey
de: Gänschen
es: Oquita
fr: Oison
ja: グーグー
ko: 꽥꽥
pt_br: Gansinho
ru: Гусик
zh_hans: 咕咕
zh_hant: 咕咕

# settings.pet.speech.section
source: Pet Speech
de: Haustierdialog
es: Diálogo de mascota
fr: Dialogue du compagnon
ja: ペット会話
ko: 펫 대화
pt_br: Fala do pet
ru: Речь питомца
zh_hans: 宠物对话
zh_hant: 寵物對話

# settings.pet.speech.mode
source: Mode
de: Modus
es: Modo
ja: モード
ko: 모드
pt_br: Modo
ru: Режим
zh_hans: 模式
zh_hant: 模式

# settings.pet.speech.frequency
source: Frequency
de: Häufigkeit
es: Frecuencia
fr: Fréquence
ja: 頻度
ko: 빈도
pt_br: Frequência
ru: Частота
zh_hans: 频率
zh_hant: 頻率

# settings.pet.speech.frequency_option_format
source: %@ · %@/hour · cooldown %@
de: %@ · %@/Std. · Abklingzeit %@
es: %@ · %@/hora · espera %@
fr: %@ · %@/h · délai %@
ja: %@ · %@/時間 · クールダウン %@
ko: %@ · 시간당 %@ · 쿨다운 %@
pt_br: %@ · %@/hora · intervalo %@
ru: %@ · %@/ч · пауза %@
zh_hans: %@ · %@/小时 · 冷却 %@
zh_hant: %@ · %@/小時 · 冷卻 %@

# settings.pet.speech.frequency_help
source: Frequency is estimated per hour, not a daily cap. The shortest global cooldown is 30 seconds.
de: Die Häufigkeit ist pro Stunde geschätzt, kein Tageslimit. Die kürzeste globale Abklingzeit beträgt 30 Sekunden.
es: La frecuencia se estima por hora, no es un límite diario. El enfriamiento global mínimo es de 30 segundos.
fr: La fréquence est estimée par heure, ce n’est pas un plafond quotidien. Le délai global minimal est de 30 secondes.
ja: 頻度は1時間あたりの目安で、1日の上限ではありません。全体クールダウンの最短は30秒です。
ko: 빈도는 일일 제한이 아니라 시간당 예상치입니다. 전체 쿨다운은 최소 30초입니다.
pt_br: A frequência é estimada por hora, não é um limite diário. O menor intervalo global é de 30 segundos.
ru: Частота оценивается за час, это не дневной лимит. Минимальная общая пауза — 30 секунд.
zh_hans: 频率按每小时估算，不是每日硬上限；所有对话最短全局冷却不低于 30 秒。
zh_hant: 頻率按每小時估算，不是每日硬上限；所有對話最短全域冷卻不低於 30 秒。

# settings.pet.speech.cooldown.seconds_format
source: %d sec
de: %d Sek.
es: %d s
fr: %d s
ja: %d秒
ko: %d초
pt_br: %d s
ru: %d с
zh_hans: %d 秒
zh_hant: %d 秒

# settings.pet.speech.quiet_during_work
source: Speak Less During Work Hours
de: Während der Arbeitszeit weniger sprechen
es: Hablar menos durante el horario laboral
fr: Parler moins pendant les heures de travail
ja: 勤務時間中は控えめに話す
ko: 업무 시간에는 덜 말하기
pt_br: Falar menos no horário de trabalho
ru: Говорить меньше в рабочие часы
zh_hans: 工作时段自动少说
zh_hant: 工作時段自動少說

# settings.pet.speech.louder_at_night
source: Speak More At Night
de: Nachts mehr sprechen
es: Hablar más por la noche
fr: Parler plus la nuit
ja: 夜は多めに話す
ko: 밤에는 더 말하기
pt_br: Falar mais à noite
ru: Говорить больше ночью
zh_hans: 夜间自动多说
zh_hant: 夜間自動多說

# settings.pet.speech.mute_on_fullscreen
source: Mute In Full Screen
de: Im Vollbild stummschalten
es: Silenciar en pantalla completa
fr: Couper le son en plein écran
ja: フルスクリーン中はミュート
ko: 전체 화면에서는 음소거
pt_br: Silenciar em tela cheia
ru: Отключать звук в полноэкранном режиме
zh_hans: 全屏时静音
zh_hant: 全螢幕時靜音

# settings.pet.speech.quiet_hours
source: Quiet Hours 22:00-08:00
de: Ruhezeit 22:00-08:00
es: Horas de silencio 22:00-08:00
fr: Heures calmes 22:00-08:00
ja: 通知オフ時間 22:00-08:00
ko: 방해 금지 시간 22:00-08:00
pt_br: Horário silencioso 22:00-08:00
ru: Тихие часы 22:00-08:00
zh_hans: 勿扰时段 22:00-08:00
zh_hant: 勿擾時段 22:00-08:00

# settings.pet.speech.mute_30_minutes
source: Mute 30 Minutes
de: 30 Minuten stummschalten
es: Silenciar 30 minutos
fr: Muet 30 minutes
ja: 30分ミュート
ko: 30분 음소거
pt_br: Silenciar por 30 minutos
ru: Отключить на 30 минут
zh_hans: 静音 30 分钟
zh_hant: 靜音 30 分鐘

# settings.pet.speech.unmute
source: Cancel Temporary Mute
de: Temporäre Stummschaltung aufheben
es: Cancelar silencio temporal
fr: Annuler le mode muet temporaire
ja: 一時ミュートを解除
ko: 임시 음소거 취소
pt_br: Cancelar silêncio temporário
ru: Отменить временное отключение
zh_hans: 取消临时静音
zh_hant: 取消臨時靜音

# settings.pet.llm.section
source: Pet LLM
de: Haustier-LLM
es: LLM de mascota
fr: LLM du compagnon
ja: ペット LLM
ko: 펫 LLM
pt_br: LLM do pet
ru: LLM питомца
zh_hans: 宠物 LLM
zh_hant: 寵物 LLM

# settings.pet.llm.enabled
source: Enable LLM Line Polishing
de: LLM-Feinschliff für Zeilen aktivieren
es: Activar pulido de frases con LLM
fr: Activer la retouche LLM des répliques
ja: LLM によるセリフ調整を有効化
ko: LLM 대사 다듬기 사용
pt_br: Ativar polimento de falas por LLM
ru: Включить полировку реплик через LLM
zh_hans: 启用 LLM 台词润色
zh_hant: 啟用 LLM 台詞潤色

# settings.pet.llm.channel
source: LLM Channel
de: LLM-Kanal
es: Canal LLM
fr: Canal LLM
ja: LLM チャンネル
ko: LLM 채널
pt_br: Canal LLM
ru: Канал LLM
zh_hans: LLM 通道
zh_hant: LLM 通道

# settings.pet.llm.channel.automatic
source: Automatic
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
pt_br: Automático
ru: Авто
zh_hans: 自动
zh_hant: 自動

# settings.pet.llm.help
source: Only rhythm and milestone messages try LLM polishing. Template lines are used if it fails, times out, or no LLM channel is available.
de: Nur Rhythmus- und Meilensteinmeldungen versuchen LLM-Feinschliff. Bei Fehlern, Zeitüberschreitung oder fehlendem LLM-Kanal werden Vorlagen verwendet.
es: Solo los mensajes de ritmo e hitos intentan usar el LLM. Se usan plantillas si falla, caduca o no hay canal LLM.
fr: Seuls les messages de rythme et de jalon utilisent la retouche LLM. Les modèles sont utilisés en cas d’échec, de délai dépassé ou d’absence de canal LLM.
ja: リズム系とマイルストーン系のメッセージだけ LLM 調整を試します。失敗、タイムアウト、LLM チャンネル未設定時はテンプレートを使います。
ko: 리듬 및 마일스톤 메시지만 LLM 다듬기를 시도합니다. 실패, 시간 초과 또는 LLM 채널이 없으면 템플릿 대사를 사용합니다.
pt_br: Só mensagens de ritmo e marco tentam usar o LLM. Modelos são usados se falhar, expirar ou não houver canal LLM.
ru: LLM используется только для ритма и вех. При ошибке, тайм-ауте или отсутствии LLM-канала используются шаблоны.
zh_hans: 只对节奏和里程碑类消息尝试调用；失败、超时或没有 LLM 通道时自动使用模板。
zh_hant: 只對節奏和里程碑類訊息嘗試呼叫；失敗、逾時或沒有 LLM 通道時自動使用範本。

# pet.speech.mode.off
source: Off
de: Aus
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끔
pt_br: Desativado
ru: Выкл.
zh_hans: 关闭
zh_hant: 關閉

# pet.speech.mode.roast
source: Roast
de: Spöttisch
es: Burla
fr: Taquin
ja: ツッコミ
ko: 잔소리
pt_br: Provocação
ru: Подколы
zh_hans: 吐槽
zh_hant: 吐槽

# pet.speech.mode.encourage
source: Encourage
de: Ermutigend
es: Ánimo
fr: Encouragement
ja: 応援
ko: 응원
pt_br: Encorajar
ru: Поддержка
zh_hans: 鼓励
zh_hant: 鼓勵

# pet.speech.mode.flirty
source: Playful
de: Verspielt
es: Juguetón
fr: Joueur
ja: 茶目っ気
ko: 장난스러움
pt_br: Brincalhão
ru: Игриво
zh_hans: 骚话
zh_hant: 俏皮

# pet.speech.mode.mixed
source: Mixed
de: Gemischt
es: Mixto
fr: Mixte
ja: ミックス
ko: 혼합
pt_br: Misto
ru: Смешанный
zh_hans: 混合
zh_hant: 混合

# pet.speech.frequency.quiet
source: Quiet
de: Ruhig
es: Callado
fr: Discret
ja: 寡黙
ko: 조용함
pt_br: Quieto
ru: Тихо
zh_hans: 寡言
zh_hant: 寡言

# pet.speech.frequency.lively
source: Lively
de: Lebhaft
es: Animado
fr: Vif
ja: 活発
ko: 활발함
pt_br: Animado
ru: Живо
zh_hans: 活泼
zh_hant: 活潑

# pet.speech.frequency.chatterbox
source: Chatty
de: Plaudernd
es: Charlatán
fr: Bavard
ja: おしゃべり
ko: 수다쟁이
pt_br: Falante
ru: Болтливо
zh_hans: 话痨
zh_hant: 話癆

# pet.desktop.hide
source: Hide Desktop Pet
de: Desktop-Haustier ausblenden
es: Ocultar mascota de escritorio
fr: Masquer le compagnon de bureau
ja: デスクトップペットを隠す
ko: 데스크톱 펫 숨기기
pt_br: Ocultar pet da área de trabalho
ru: Скрыть питомца на рабочем столе
zh_hans: 隐藏桌面宠物
zh_hant: 隱藏桌面寵物

# pet.desktop.mute_30_minutes
source: Mute 30 Minutes
de: 30 Minuten stummschalten
es: Silenciar 30 minutos
fr: Muet 30 minutes
ja: 30分ミュート
ko: 30분 음소거
pt_br: Silenciar por 30 minutos
ru: Отключить на 30 минут
zh_hans: 静音 30 分钟
zh_hant: 靜音 30 分鐘

# pet.desktop.mute_1_hour
source: Mute 1 Hour
de: 1 Stunde stummschalten
es: Silenciar 1 hora
fr: Muet 1 heure
ja: 1時間ミュート
ko: 1시간 음소거
pt_br: Silenciar por 1 hora
ru: Отключить на 1 час
zh_hans: 静音 1 小时
zh_hant: 靜音 1 小時

# pet.desktop.mute_today
source: Mute Today
de: Heute stummschalten
es: Silenciar hoy
fr: Muet aujourd’hui
ja: 今日は話さない
ko: 오늘은 말 안 함
pt_br: Silenciar hoje
ru: Отключить на сегодня
zh_hans: 今天不说话
zh_hant: 今天不說話

# pet.desktop.skip_line
source: Skip Line
de: Zeile überspringen
es: Omitir frase
fr: Ignorer la réplique
ja: このセリフをスキップ
ko: 이 대사 건너뛰기
pt_br: Pular fala
ru: Пропустить реплику
zh_hans: 跳过这条
zh_hant: 跳過這條

# pet.desktop.speak_more
source: Speak More
de: Mehr sprechen
es: Hablar más
fr: Parler plus
ja: もっと話す
ko: 더 말하기
pt_br: Falar mais
ru: Говорить больше
zh_hans: 多说点
zh_hant: 多說點

# pet.desktop.speak_less
source: Speak Less
de: Weniger sprechen
es: Hablar menos
fr: Parler moins
ja: 少なめに話す
ko: 덜 말하기
pt_br: Falar menos
ru: Говорить меньше
zh_hans: 少说点
zh_hant: 少說點

# pet.desktop.scale_up
source: Make Larger
de: Vergrößern
es: Agrandar
fr: Agrandir
ja: 大きくする
ko: 크게 보기
pt_br: Aumentar
ru: Увеличить
zh_hans: 放大
zh_hant: 放大

# pet.desktop.scale_down
source: Make Smaller
de: Verkleinern
es: Reducir
fr: Réduire
ja: 小さくする
ko: 작게 보기
pt_br: Diminuir
ru: Уменьшить
zh_hans: 缩小
zh_hant: 縮小

# pet.desktop.scale_reset
source: Reset Size
de: Größe zurücksetzen
es: Restablecer tamaño
fr: Taille par défaut
ja: サイズをリセット
ko: 크기 초기화
pt_br: Redefinir tamanho
ru: Сбросить размер
zh_hans: 恢复默认大小
zh_hant: 恢復預設大小

# settings.pet.reminder.hydration
source: Hydration Reminder
de: Trinkerinnerung
es: Recordatorio para beber agua
fr: Rappel d'hydratation
ja: 水分補給リマインダー
ko: 물 마시기 알림
pt_br: Lembrete de hidratação
ru: Напоминание пить воду
zh_hans: 喝水提醒
zh_hant: 喝水提醒

# settings.pet.reminder.hydration_interval
source: Hydration Interval
de: Trinkintervall
es: Intervalo para beber agua
fr: Intervalle d'hydratation
ja: 水分補給の間隔
ko: 물 마시기 간격
pt_br: Intervalo de hidratação
ru: Интервал напоминания пить воду
zh_hans: 喝水提醒间隔
zh_hant: 喝水提醒間隔

# settings.pet.reminder.sedentary
source: Sedentary Reminder
de: Erinnerung zum Aufstehen
es: Recordatorio para levantarte
fr: Rappel pour se lever
ja: 立ち上がりリマインダー
ko: 일어나기 알림
pt_br: Lembrete para levantar
ru: Напоминание встать
zh_hans: 久坐提醒
zh_hant: 久坐提醒

# settings.pet.reminder.sedentary_interval
source: Sedentary Interval
de: Aufstehintervall
es: Intervalo para levantarte
fr: Intervalle pour se lever
ja: 立ち上がり間隔
ko: 일어나기 간격
pt_br: Intervalo para levantar
ru: Интервал напоминания встать
zh_hans: 久坐提醒间隔
zh_hant: 久坐提醒間隔

# settings.pet.reminder.late_night
source: Late-Night Reminder
de: Spätabend-Erinnerung
es: Recordatorio nocturno
fr: Rappel tard dans la nuit
ja: 深夜リマインダー
ko: 늦은 밤 알림
pt_br: Lembrete de madrugada
ru: Ночное напоминание
zh_hans: 深夜提醒
zh_hant: 深夜提醒

# settings.pet.reminder.late_night_interval
source: Late-Night Interval
de: Spätabend-Intervall
es: Intervalo nocturno
fr: Intervalle tard dans la nuit
ja: 深夜リマインダー間隔
ko: 늦은 밤 알림 간격
pt_br: Intervalo de madrugada
ru: Интервал ночного напоминания
zh_hans: 深夜提醒间隔
zh_hant: 深夜提醒間隔

# pet.persona.balanced
source: Zero Protocol
de: Nullprotokoll
es: Protocolo cero
fr: Protocole zéro
ja: ゼロプロトコル
ko: 제로 프로토콜
pt_br: Protocolo zero
ru: Нулевой протокол
zh_hans: 零协议
zh_hant: 零協議

# settings.theme.group.dark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
ja: ダーク
ko: 다크
pt_br: Escuro
ru: Тёмные
zh_hans: 深色
zh_hant: 深色

# settings.theme.group.light
source: Light
de: Hell
es: Claro
fr: Clair
ja: ライト
ko: 라이트
pt_br: Claro
ru: Светлые
zh_hans: 浅色
zh_hant: 淺色

# memory.status.input_too_long
source: Memory input too long
de: Speichereingabe zu lang
es: Entrada de memoria demasiado larga
fr: Entrée mémoire trop longue
ja: メモリ入力が長すぎます
ko: 메모리 입력이 너무 깁니다
pt_br: Entrada de memória longa demais
ru: Ввод памяти слишком длинный
zh_hans: 记忆输入过长
zh_hant: 記憶輸入過長

# memory.status.local_input_too_long_detail
source: Memory input exceeded the local model context window. Codux will compact and retry it automatically.
de: Die Speichereingabe war größer als das Kontextfenster des lokalen Modells. Codux komprimiert sie und versucht es automatisch erneut.
es: La entrada de memoria superó la ventana de contexto del modelo local. Codux la compactará y reintentará automáticamente.
fr: L’entrée mémoire dépasse la fenêtre de contexte du modèle local. Codux va la compacter et réessayer automatiquement.
ja: メモリ入力がローカルモデルのコンテキスト上限を超えました。Codux が自動で圧縮して再試行します。
ko: 메모리 입력이 로컬 모델의 컨텍스트 창을 초과했습니다. Codux가 자동으로 압축해 다시 시도합니다.
pt_br: A entrada de memória excedeu a janela de contexto do modelo local. O Codux vai compactar e tentar novamente automaticamente.
ru: Ввод памяти превысил контекстное окно локальной модели. Codux сожмет его и повторит попытку автоматически.
zh_hans: 记忆输入超过了本地模型上下文窗口。Codux 会自动压缩并重试。
zh_hant: 記憶輸入超過了本地模型上下文視窗。Codux 會自動壓縮並重試。

# memory.status.needs_setup
source: Memory setup needed
de: Speicher einrichten
es: Configura la memoria
fr: Configuration mémoire requise
ja: メモリ設定が必要
ko: 메모리 설정 필요
pt_br: Configurar memória
ru: Настройте память
zh_hans: 记忆待配置
zh_hant: 記憶待設定

# memory.status.provider_configuration_needed
source: Memory needs an enabled AI channel. In Settings > AI, enable a provider and turn on Use For Memory Extraction.
de: Der Speicher braucht einen aktivierten AI-Kanal. Aktiviere unter Einstellungen > AI einen Anbieter und schalte „Für Speicherextraktion verwenden“ ein.
es: La memoria necesita un canal de AI habilitado. En Ajustes > AI, activa un proveedor y enciende “Usar para extracción de memoria”.
fr: La mémoire nécessite un canal AI activé. Dans Réglages > AI, activez un fournisseur et l’option « Utiliser pour l’extraction de mémoire ».
ja: メモリには有効な AI チャネルが必要です。設定 > AI でプロバイダーを有効にし、「メモリ抽出に使用」をオンにしてください。
ko: 메모리에는 활성화된 AI 채널이 필요합니다. 설정 > AI에서 공급자를 켜고 “메모리 추출에 사용”을 켜세요.
pt_br: A memória precisa de um canal de AI ativado. Em Ajustes > AI, ative um provedor e marque “Usar para extração de memória”.
ru: Памяти нужен включенный AI-канал. В Настройки > AI включите провайдера и параметр «Использовать для извлечения памяти».
zh_hans: 记忆需要可用的 AI 渠道。请在设置 > AI 启用渠道，并打开“用于记忆提取”。
zh_hant: 記憶需要可用的 AI 渠道。請在設定 > AI 啟用渠道，並開啟「用於記憶擷取」。

# settings.ai.memory.automatic_extraction
source: Automatic Extraction
de: Automatische Extraktion
es: Extracción automática
fr: Extraction automatique
ja: 自動抽出
ko: 자동 추출
pt_br: Extração automática
ru: Автоматическое извлечение
zh_hans: 自动提取
zh_hant: 自動擷取

# settings.ai.memory.automatic_injection
source: Automatic Injection
de: Automatische Injektion
es: Inyección automática
fr: Injection automatique
ja: 自動注入
ko: 자동 주입
pt_br: Injeção automática
ru: Автоматическое внедрение
zh_hans: 自动注入
zh_hant: 自動注入

# settings.ai.memory.cross_project_user
source: Cross-Project User Memory
de: Projektübergreifender Benutzerspeicher
es: Memoria de usuario entre proyectos
fr: Mémoire utilisateur inter-projets
ja: プロジェクト横断ユーザーメモリ
ko: 프로젝트 간 사용자 메모리
pt_br: Memória de usuário entre projetos
ru: Пользовательская память между проектами
zh_hans: 跨项目用户记忆
zh_hant: 跨專案使用者記憶

# settings.ai.memory.default_extraction_provider
source: Default Extraction Provider
de: Standardanbieter für Extraktion
es: Proveedor de extracción predeterminado
fr: Fournisseur d'extraction par défaut
ja: 既定の抽出プロバイダー
ko: 기본 추출 제공자
pt_br: Provedor de extração padrão
ru: Поставщик извлечения по умолчанию
zh_hans: 默认提取提供商
zh_hant: 預設擷取提供商

# settings.ai.memory.extraction_provider.automatic
source: Automatic
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
pt_br: Automático
ru: Автоматически
zh_hans: 自动
zh_hant: 自動

# settings.ai.memory.extraction_provider.automatic_help
source: Automatic uses selected memory providers by priority.
de: Automatisch verwendet zuerst das aktuelle Terminalwerkzeug und danach die Anbieterpriorität.
es: Automático usa primero la herramienta del terminal actual y luego recurre a la prioridad del proveedor.
fr: Automatique utilise d'abord l'outil du terminal actuel, puis se rabat sur la priorité des fournisseurs.
ja: 自動では現在のターミナルツールを優先し、その後プロバイダーの優先度にフォールバックします。
ko: 자동은 현재 터미널 도구를 먼저 사용하고, 이후 제공자 우선순위로 대체합니다.
pt_br: Automático usa primeiro a ferramenta do terminal atual e depois recorre à prioridade do provedor.
ru: Автоматически сначала использует инструмент текущего терминала, затем приоритет поставщиков.
zh_hans: 自动按已选择的记忆提供方优先级提取。
zh_hant: 自動按已選擇的記憶提供方優先級擷取。

# settings.ai.memory.enabled
source: Enable Memory
de: Speicher aktivieren
es: Activar memoria
fr: Activer la mémoire
ja: メモリを有効化
ko: 메모리 활성화
pt_br: Ativar memória
ru: Включить память
zh_hans: 启用记忆
zh_hant: 啟用記憶

# settings.ai.memory.project_working_recall
source: Project Working Recall
de: Projekt-Arbeitsspeicherabruf
es: Recuperación de memoria de proyecto
fr: Rappel de mémoire de projet
ja: プロジェクト作業メモリ数
ko: 프로젝트 작업 메모리 수
pt_br: Recuperação de memória do projeto
ru: Вызов рабочей памяти проекта
zh_hans: 项目工作记忆数量
zh_hant: 專案工作記憶數量

# settings.ai.memory.user_working_recall
source: User Working Recall
de: Benutzer-Arbeitsspeicherabruf
es: Recuperación de memoria de usuario
fr: Rappel de mémoire utilisateur
ja: ユーザー作業メモリ数
ko: 사용자 작업 메모리 수
pt_br: Recuperação de memória do usuário
ru: Вызов рабочей памяти пользователя
zh_hans: 用户工作记忆数量
zh_hant: 使用者工作記憶數量

# settings.ai.provider.api_key
source: API Key
de: API-Schlüssel
es: Clave API
fr: Clé API
ja: APIキー
ko: API 키
pt_br: Chave de API
ru: Ключ API
zh_hans: API 密钥
zh_hant: API 金鑰

# settings.ai.provider.base_url
source: Base URL
de: Basis-URL
es: URL base
fr: URL de base
ja: ベースURL
ko: 기본 URL
pt_br: URL base
ru: Базовый URL
zh_hans: 基础 URL
zh_hant: 基礎 URL

# settings.ai.provider.enabled
source: Enabled
de: Aktiviert
es: Activado
fr: Activé
ja: 有効
ko: 활성화
pt_br: Ativado
ru: Включено
zh_hans: 启用
zh_hant: 啟用

# settings.ai.provider.model
source: Model
de: Modell
es: Modelo
fr: Modèle
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
zh_hans: 模型
zh_hant: 模型

# settings.ai.provider.priority
source: Priority
de: Priorität
es: Prioridad
fr: Priorité
ja: 優先度
ko: 우선순위
pt_br: Prioridade
ru: Приоритет
zh_hans: 优先级
zh_hant: 優先順序

# settings.ai.provider.use_for_memory_extraction
source: Use For Memory Extraction
de: Für Speicherextraktion verwenden
es: Usar para extraer memoria
fr: Utiliser pour l'extraction de mémoire
ja: メモリ抽出に使用
ko: 메모리 추출에 사용
pt_br: Usar para extração de memória
ru: Использовать для извлечения памяти
zh_hans: 用于记忆提取
zh_hant: 用於記憶擷取

# settings.ai.section.memory
source: Memory
de: Speicher
es: Memoria
fr: Mémoire
ja: メモリ
ko: 메모리
pt_br: Memória
ru: Память
zh_hans: 记忆
zh_hant: 記憶

# settings.ai.section.providers
source: AI Providers
de: Anbieter
es: Proveedores
fr: Fournisseurs
ja: プロバイダー
ko: 제공자
pt_br: Provedores
ru: Поставщики
zh_hans: AI 提供方
zh_hant: AI 提供方

# settings.ai.section.runtime_tools
source: Runtime Tools
de: Laufzeit-Tools
es: Herramientas de ejecución
fr: Outils d'exécution
ja: ランタイムツール
ko: 런타임 도구
pt_br: Ferramentas de execução
ru: Инструменты выполнения
zh_hans: 运行工具
zh_hant: 執行工具

# settings.ai.permission.full_access_toggle
source: Full Access
de: Vollzugriff
es: Acceso completo
fr: Accès complet
ja: フルアクセス
ko: 전체 권한
pt_br: Acesso total
ru: Полный доступ
zh_hans: 完全权限
zh_hant: 完整權限

# settings.ai.provider.default.local_llama
source: Llama Model
de: Llama-Modell
es: Modelo Llama
fr: Modèle Llama
ja: Llama モデル
ko: Llama 모델
pt_br: Modelo Llama
ru: Модель Llama
zh_hans: Llama 模型
zh_hant: Llama 模型

# settings.ai.provider.kind.local_llama
source: Llama Model
de: Llama-Modell
es: Modelo Llama
fr: Modèle Llama
ja: Llama モデル
ko: Llama 모델
pt_br: Modelo Llama
ru: Модель Llama
zh_hans: Llama 模型
zh_hant: Llama 模型

# settings.ai.provider.local_llama_help
source: Runs llama.cpp locally for memory extraction and pet line polishing. The model catalog refreshes from GitHub, and model downloads prefer ModelScope in China.
de: Führt llama.cpp lokal für Speicherextraktion und Haustier-Textverfeinerung aus. Der Modellkatalog wird von GitHub aktualisiert; in China werden Downloads bevorzugt über ModelScope geladen.
es: Ejecuta llama.cpp localmente para extraer memoria y pulir frases de la mascota. El catálogo de modelos se actualiza desde GitHub y en China se prioriza ModelScope para descargas.
fr: Exécute llama.cpp localement pour l’extraction de mémoire et la retouche des répliques du compagnon. Le catalogue se met à jour depuis GitHub et les téléchargements privilégient ModelScope en Chine.
ja: 記憶抽出とペットの台詞調整に llama.cpp をローカルで使用します。モデル一覧は GitHub から更新され、中国では ModelScope のダウンロード経路を優先します。
ko: 메모리 추출과 펫 대사 다듬기에 llama.cpp를 로컬로 사용합니다. 모델 목록은 GitHub에서 새로 고치며, 중국에서는 ModelScope 다운로드 경로를 우선합니다.
pt_br: Executa llama.cpp localmente para extração de memória e polimento das falas do pet. O catálogo de modelos é atualizado pelo GitHub e, na China, os downloads priorizam o ModelScope.
ru: Локально запускает llama.cpp для извлечения памяти и доработки реплик питомца. Каталог моделей обновляется с GitHub, а в Китае загрузки предпочитают ModelScope.
zh_hans: 使用本机 llama.cpp 做记忆提取和宠物台词润色。模型列表会从 GitHub 刷新，国内下载优先使用 ModelScope。
zh_hant: 使用本機 llama.cpp 做記憶擷取和寵物台詞潤飾。模型列表會從 GitHub 重新整理，國內下載優先使用 ModelScope。

# settings.remote.enabled
source: Enable Remote Host
de: Remote-Host aktivieren
es: Activar host remoto
fr: Activer l’hôte distant
ja: リモートホストを有効化
ko: 원격 호스트 사용
pt_br: Ativar host remoto
ru: Включить удаленный хост
zh_hans: 启用远程主机
zh_hant: 啟用遠端主機
